import { areaStyle } from "../plugins/vcharts"

export default {
    pieChartSettings: { type: "pie" },
    pieChartData: {
      columns: ["key", "value"],
      rows: [
        { key: "technical", value: 3 },
        { key: "study", value: 5 },
        { key: "notes", value: 8 },
      ],
    },
    lineChartData: {
      columns: ["日期", "访问量", "获赞量", "下单率"],
      rows: [
        { 日期: "2020/1/1", 访问量: 1393, 获赞量: 1093, 下单率: 0.32 },
        { 日期: "2020/1/2", 访问量: 3530, 获赞量: 3230, 下单率: 0.26 },
        { 日期: "2020/1/3", 访问量: 2923, 获赞量: 2623, 下单率: 0.76 },
        { 日期: "2020/1/4", 访问量: 1723, 获赞量: 1423, 下单率: 0.49 },
        { 日期: "2020/1/5", 访问量: 3792, 获赞量: 3492, 下单率: 0.323 },
        { 日期: "2020/1/6", 访问量: 4593, 获赞量: 4293, 下单率: 0.78 },
      ],
    },
    lineChartSettings: {
      // 值区域填充样式
      areaStyle,
    },
    lineChartData2: {
      columns: ["日期", "注册人数"],
      rows: [
        { 日期: "2020/1/1", 注册人数: 1393 },
        { 日期: "2020/1/2", 注册人数: 3530 },
        { 日期: "2020/1/3", 注册人数: 2923 },
        { 日期: "2020/1/4", 注册人数: 1723 },
        { 日期: "2020/1/5", 注册人数: 3792 },
        { 日期: "2020/1/6", 注册人数: 4593 },
      ],
    },
    lineChartSettings2: {
      // 值区域填充样式
      areaStyle,
    },
    histogramChartData: {
      columns: ["日期", "访问量", "获赞量", "获赞率"],
      rows: [
        { 日期: "2020-1-1", 访问量: 1393, 获赞量: 1093, 获赞率: 0.32 },
        { 日期: "2020-1-2", 访问量: 3530, 获赞量: 3230, 获赞率: 0.26 },
        { 日期: "2020-1-3", 访问量: 2923, 获赞量: 2623, 获赞率: 0.76 },
        { 日期: "2020-1-4", 访问量: 1723, 获赞量: 1423, 获赞率: 0.49 },
        { 日期: "2020-1-5", 访问量: 3792, 获赞量: 3492, 获赞率: 0.323 },
        { 日期: "2020-1-6", 访问量: 4593, 获赞量: 4293, 获赞率: 0.78 },
      ],
    },
  }